artifacts/logs/benchmark-snapshot-20260205-190207.txt
Benchmark Snapshot: 2026-02-06T01:02:07Z
Target: http://localhost:3001

== / ==
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3001

Document Path:          /
Document Length:        7107 bytes

Concurrency Level:      25
Time taken for tests:   0.028 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      3696500 bytes
HTML transferred:       3553500 bytes
Requests per second:    17582.73 [#/sec] (mean)
Time per request:       1.422 [ms] (mean)
Time per request:       0.057 [ms] (mean, across all concurrent requests)
Transfer rate:          126942.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.5      1       4
Waiting:        0    1   0.4      1       3
Total:          1    1   0.5      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      2
  90%      2
  95%      2
  98%      3
  99%      3
 100%      4 (longest request)

== /admin ==
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3001

Document Path:          /admin
Document Length:        4975 bytes

Concurrency Level:      25
Time taken for tests:   0.031 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      2630500 bytes
HTML transferred:       2487500 bytes
Requests per second:    16180.71 [#/sec] (mean)
Time per request:       1.545 [ms] (mean)
Time per request:       0.062 [ms] (mean, across all concurrent requests)
Transfer rate:          83131.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      0       2
Processing:     0    1   0.5      1       3
Waiting:        0    1   0.4      1       2
Total:          0    1   0.7      1       3
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      3
  95%      3
  98%      3
  99%      3
 100%      3 (longest request)

== /barber ==
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3001

Document Path:          /barber
Document Length:        5980 bytes

Concurrency Level:      25
Time taken for tests:   0.031 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      3133000 bytes
HTML transferred:       2990000 bytes
Requests per second:    16003.58 [#/sec] (mean)
Time per request:       1.562 [ms] (mean)
Time per request:       0.062 [ms] (mean, across all concurrent requests)
Transfer rate:          97928.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      0       2
Processing:     0    1   0.6      1       3
Waiting:        0    1   0.4      1       3
Total:          0    1   0.7      1       4
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      3
  99%      4
 100%      4 (longest request)

== /ops/runtime ==
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3001

Document Path:          /ops/runtime
Document Length:        207 bytes

Concurrency Level:      25
Time taken for tests:   0.028 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      165000 bytes
HTML transferred:       103500 bytes
Requests per second:    17753.16 [#/sec] (mean)
Time per request:       1.408 [ms] (mean)
Time per request:       0.056 [ms] (mean, across all concurrent requests)
Transfer rate:          5721.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       3
Processing:     0    1   0.7      1       4
Waiting:        0    1   0.5      1       3
Total:          0    1   0.8      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      3
  98%      4
  99%      4
 100%      4 (longest request)